# Homebrew packages for easy installation on a new computer
# Install with: brew bundle --file=Brewfile

# Taps
tap "1password/tap"
tap "domt4/autoupdate"
tap "esolitos/ipa"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"

# Formulae
brew "automake"
brew "awscli"
brew "cloudflare-wrangler"
brew "composer"
brew "coreutils"
brew "deno"
brew "difftastic"
brew "docutils"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "graphviz"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lefthook"
brew "leoafarias/fvm/fvm"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "oven-sh/bun/bun"
brew "pinentry-mac"
brew "pnpm"
brew "pv"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "shfmt"
brew "stow"
brew "stripe-cli"
brew "tldr"
brew "tmux"
brew "trash"
brew "whisper-cpp"
brew "yarn"
brew "zlib"
brew "zoxide"

# Casks
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "aldente"
cask "docker"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "kitty"
cask "loom"
cask "ngrok"
cask "notion"
cask "notunes"
cask "orbstack"
cask "postman"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
