tap "1password/tap"
tap "amplitude/ampli"
tap "anomalyco/tap"
tap "domt4/autoupdate"
tap "hashicorp/tap"
tap "kitlangton/tap"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "pluk-inc/tap"
tap "steipete/tap"
brew "autoconf"
brew "automake"
brew "awscli"
brew "carapace"
brew "node"
brew "cloudflare-wrangler"
brew "libtool"
brew "libpq"
brew "php"
brew "composer"
brew "coreutils"
brew "deno"
brew "difftastic"
brew "duti"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "libksba"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lefthook"
brew "lftp"
brew "libyaml"
brew "mas"
brew "mole"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "pv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rtk"
brew "shfmt"
brew "sox"
brew "stow"
brew "stripe-cli"
brew "terminal-notifier"
brew "tmux"
brew "trash", link: true
brew "whisper-cpp"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "amplitude/ampli/ampli"
brew "hashicorp/tap/terraform"
brew "kitlangton/tap/ghui"
brew "oven-sh/bun/bun@1.3.5"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "arc"
cask "battery"
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "codex"
cask "steipete/tap/codexbar"
cask "cursor"
cask "figma"
cask "finicky"
cask "firefox", args: { appdir: "/Applications" }
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "kitlangton-hex"
cask "kitty"
cask "linear"
cask "loom"
cask "pluk-inc/tap/markdown-preview"
cask "microsoft-excel"
cask "microsoft-word"
cask "ngrok"
cask "notion", args: { appdir: "/Applications" }
cask "notion-calendar"
cask "notion-mail"
cask "obs"
cask "openvpn-connect"
cask "orbstack"
cask "postman", args: { appdir: "/Applications" }
cask "raycast"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "tailscale-app"
cask "telegram", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "windsurf"
cask "xbar"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
npm "corepack"
npm "jscpd"
npm "opencode-ai"
npm "vercel"
